DataSet Download Link:   https://www.kaggle.com/datasets/tiagoadrianunes/imdb-top-5000-tv-shows

In [1]:
import pandas as pd

In [2]:
data = pd.read_csv("imdb_top_5000_tv_shows.csv")
data.shape
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5000 entries, 0 to 4999
Data columns (total 12 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   tconst           5000 non-null   object
 1   primaryTitle     5000 non-null   object
 2   startYear        5000 non-null   int64
 3   endYear          4153 non-null   float64
 4   rank             5000 non-null   int64
 5   averageRating    5000 non-null   float64
 6   numVotes         5000 non-null   int64
 7   directors        5000 non-null   object
 8   writers          5000 non-null   object
 9   genres           5000 non-null   object
 10  IMDbLink         5000 non-null   object
 11  Title_IMDb_Link  5000 non-null   object
dtypes: float64(2), int64(3), object(7)
memory usage: 468.9+ KB

In [3]:
data.drop(["IMDbLink","Title_IMDb_Link"], axis=1, inplace=True)
data.head(1)

,tconst,primaryTitle,startYear,endYear,rank,averageRating,numVotes,directors,writers,genres
0,tt0903747,Breaking Bad,2008,2013.0,1,9.5,2384857,"Michelle MacLaren, Adam Bernstein, Vince Gilli...","Vince Gilligan, Peter Gould, George Mastras, S...","Crime, Drama, Thriller"

In [4]:
data["startYear"]=pd.to_datetime(data["startYear"],format="%Y").dt.to_period('Y')
data["endYear"]=pd.to_datetime(data["endYear"],format="%Y", errors="coerce").dt.to_period('Y')
print(data.dtypes)
print(data[['startYear', 'endYear']].head())

tconst                  object
primaryTitle            object
startYear        period[Y-DEC]
endYear          period[Y-DEC]
rank                     int64
averageRating          float64
numVotes                 int64
directors               object
writers                 object
genres                  object
dtype: object
  startYear endYear
0      2008    2013
1      2001    2001
2      2019    2019
3      2005    2008
4      2002    2008

### Q1:
How many rows and columns are in your dataset after dropping those two link columns?

In [5]:
print("rows and columns after deleting two columns: ",data.shape)

rows and columns after deleting two columns:  (5000, 10)

### Q2:
Can you find the column names that are still present in your dataset after this deletion?

In [6]:
print("columns in my dataset are: ")
for n in list(data.columns):
  print(n)

columns in my dataset are:
tconst
primaryTitle
startYear
endYear
rank
averageRating
numVotes
directors
writers
genres

### Q3:
Now, can you check how many missing values are there in each column?

In [7]:
print("missing or null values in each of the columns are:\n", data.isnull().sum())

missing or null values in each of the columns are:
 tconst             0
primaryTitle       0
startYear          0
endYear          847
rank               0
averageRating      0
numVotes           0
directors          0
writers            0
genres             0
dtype: int64

### Q4:
Now, instead of just showing, can you try to count the total number of missing values in the whole dataset?

In [8]:
print("total no of null or missing values in my data is: ",data.isnull().sum().sum())

total no of null or missing values in my data is:  847

### Q5:
Print the data types of each column in your dataset.

In [9]:
print("Datatypes of each column in my dataset are: \n",data.dtypes)

Datatypes of each column in my dataset are:
 tconst                  object
primaryTitle            object
startYear        period[Y-DEC]
endYear          period[Y-DEC]
rank                     int64
averageRating          float64
numVotes                 int64
directors               object
writers                 object
genres                  object
dtype: object

### Q6:
Identify which columns in your dataset are categorical, which are numerical, and which are datetime.

In [10]:
print("numerical columns: ",data.select_dtypes(include=['int64', 'float64', 'int32', 'float32']).columns.tolist())
print("categorical columns: ",data.select_dtypes(include=['object', 'category']).columns.tolist())
print("datetime columns: ",data.select_dtypes(include=['datetime64']).columns.tolist())

numerical columns:  ['rank', 'averageRating', 'numVotes']
categorical columns:  ['tconst', 'primaryTitle', 'directors', 'writers', 'genres']
datetime columns:  []

In [11]:
data.head()

,tconst,primaryTitle,startYear,endYear,rank,averageRating,numVotes,directors,writers,genres
0,tt0903747,Breaking Bad,2008,2013,1,9.5,2384857,"Michelle MacLaren, Adam Bernstein, Vince Gilli...","Vince Gilligan, Peter Gould, George Mastras, S...","Crime, Drama, Thriller"
1,tt0185906,Band of Brothers,2001,2001,2,9.4,570504,"David Frankel, Mikael Salomon, Tom Hanks, Davi...","Stephen Ambrose, Erik Bork, E. Max Frye, Tom H...","Action, Drama, History"
2,tt7366338,Chernobyl,2019,2019,3,9.3,970478,Johan Renck,Craig Mazin,"Drama, History, Thriller"
3,tt0417299,Avatar: The Last Airbender,2005,2008,4,9.3,415015,"Giancarlo Volpe, Ethan Spaulding, Lauren MacMu...","Michael Dante DiMartino, Bryan Konietzko, Aaro...","Action, Adventure, Animation"
4,tt0306414,The Wire,2002,2008,5,9.3,410674,"Joe Chappelle, Ernest R. Dickerson, Clark John...","David Simon, Ed Burns, Joy Kecken, Rafael Álva...","Crime, Drama, Thriller"

### Q7.
From your dataset, extract only those shows whose averageRating is greater than 9.0 and numVotes is more than 1 million.

In [12]:
data.loc[(data["averageRating"] > 9.0) & (data["numVotes"] > 1000000)]

,tconst,primaryTitle,startYear,endYear,rank,averageRating,numVotes,directors,writers,genres
0,tt0903747,Breaking Bad,2008,2013,1,9.5,2384857,"Michelle MacLaren, Adam Bernstein, Vince Gilli...","Vince Gilligan, Peter Gould, George Mastras, S...","Crime, Drama, Thriller"
7,tt0944947,Game of Thrones,2011,2019,8,9.2,2472062,"David Nutter, Alan Taylor, Alex Graves, Miguel...","David Benioff, George R.R. Martin, D.B. Weiss,...","Action, Adventure, Drama"

### Q8. 
Find all the unique genres present in the dataset (not just the first value, but split the comma-separated list into unique individual genres).

In [13]:
unique_genres = data["genres"].str.split(",").explode().str.strip().unique()
print("All unique genres in dataset are: ", unique_genres)

All unique genres in dataset are:  ['Crime' 'Drama' 'Thriller' 'Action' 'History' 'Adventure' 'Animation'
 'Documentary' 'Family' 'Biography' 'Mystery' 'Comedy' 'Romance' 'Sport'
 'Sci-Fi' 'Fantasy' 'Horror' 'Reality-TV' 'News' 'Talk-Show' 'War'
 'Western' 'Music' 'Game-Show' 'Musical' 'Short']

### Q9. 
Count how many shows belong to each individual genre (e.g., how many are “Crime,” how many are “Drama,” etc.).

In [14]:
data["genres"].str.split(",").explode().str.strip().value_counts()

genres
Drama          2639
Comedy         1840
Crime          1007
Action          869
Animation       818
Adventure       774
Romance         565
Mystery         535
Documentary     507
History         348
Fantasy         319
Thriller        286
Family          248
Biography       210
Horror          141
Reality-TV      140
Sci-Fi          134
Music           113
Sport           111
War             102
Game-Show        79
Talk-Show        52
Western          40
News             26
Short            26
Musical          22
Name: count, dtype: int64

### Q10. 
Find the top 5 shows with the highest number of votes (numVotes), but only display their primaryTitle, averageRating, and numVotes.

In [15]:
data.loc[data["numVotes"].nlargest(5).index,["primaryTitle","averageRating",'numVotes']]

         primaryTitle  averageRating  numVotes
7     Game of Thrones            9.2   2472062
0        Breaking Bad            9.5   2384857
70    Stranger Things            8.6   1478495
20            Friends            8.9   1158004
370  The Walking Dead            8.1   1157879

### Q11. 
Find the average IMDb rating (averageRating) for each genre (treating genres separately, not as comma-joined strings).

In [16]:
df = data.assign(genre=data["genres"].str.split(',').explode("genre"))
df["genre"]=df["genre"].str.strip()
df.groupby("genre")["averageRating"].mean().sort_values(ascending=False)

genre
News           8.328571
War            8.094118
Western        8.080000
Documentary    8.041830
Sport          8.039535
Short          8.033333
Crime          8.023128
Action         8.023041
Drama          8.012533
Horror         8.003226
Fantasy        7.995556
Animation      7.994663
Adventure      7.994490
Game-Show      7.988889
Family         7.977778
Mystery        7.974569
Thriller       7.972932
History        7.963636
Sci-Fi         7.955738
Comedy         7.954018
Romance        7.951563
Biography      7.945882
Reality-TV     7.933333
Talk-Show      7.913043
Musical        7.907692
Music          7.832432
Name: averageRating, dtype: float64

### Q12. 
For each director, calculate the average rating of the shows they directed, and then list the top 10 directors by average rating (consider only those with at least 2 shows in the dataset).

In [17]:
df = data.assign(director=data["directors"].str.split(",")).explode("director")
df["director"] = df["director"].str.strip().str.lower()
result = (
    df.groupby("director")
    .filter(lambda x: len(x) >= 2)
    .groupby("director")["averageRating"]
    .mean()
    .nlargest(10)
    .reset_index()
)
result["director"] = result["director"].str.capitalize()
result

         director  averageRating
0     Fredi devas       9.350000
1  Thomas schnauz       9.250000
2  Chadden hunter       9.200000
3      Ed charles       9.200000
4     Emma napper       9.200000
5   Mark linfield       9.166667
6      Ann druyan       9.100000
7      Huw cordey       9.100000
8    Rosie thomas       9.100000
9   Adrian malone       9.050000

### Q13. 
Find the most common pairings of directors and writers (i.e., which director–writer combinations occur most frequently in the dataset)

In [44]:
df = (
    data.assign(
        director=data["directors"].str.split(","), writer=data["writers"].str.split(",")
    )
    .explode("director")
    .explode("writer")
)
df["director"] = df["director"].str.strip().str.lower()
df["writer"] = df["writer"].str.strip().str.lower()

valid_data = df[
    ~df["director"].isin(["-", "", None]) & ~df["writer"].isin(["-", "", None])
]
top_combination = (
    valid_data.groupby(["director", "writer"])
    .size()
    .nlargest(1)
    .reset_index(name="Shows togather")
)
top_combination["director"] = top_combination["director"].str.title()
top_combination["writer"] = top_combination["writer"].str.title()
top_combination


# output will be:
#   director	        writer	        Shows togather
# 0	Herschel Daugherty	Dick Nelson	    9

             director       writer  Shows togather
0  Herschel Daugherty  Dick Nelson               9

### Q14.
Find the year with the highest average rating across all shows. If there are ties, list all such years.

In [19]:
data.groupby("startYear")["averageRating"].mean().nlargest(1).reset_index(
    name="avg_rating"
)

  startYear  avg_rating
0      1950    8.533333

### Q15. 
Find the show(s) with the longest run (difference between endYear and startYear)

In [20]:
data.loc[(data["endYear"].dt.year - data["startYear"].dt.year).idxmax()]

tconst                                                   tt0234355
primaryTitle                                  Well, Just You Wait!
startYear                                                     1969
endYear                                                       2017
rank                                                          1196
averageRating                                                  8.5
numVotes                                                      6870
directors        Vyacheslav Kotyonochkin, Aleksey Kotyonochkin,...
writers          Aleksandr Kurlyandskiy, Arkadiy Khayt, Feliks ...
genres                                Action, Adventure, Animation
Name: 1195, dtype: object

### Q16. 
Find the top 5 shows with the highest “votes per year of run”.
👉 Formula = numVotes / (endYear - startYear + 1)

In [21]:
data.loc[(data["numVotes"]/(data["endYear"].dt.year - data["startYear"].dt.year +1)).nlargest(5).index]

,tconst,primaryTitle,startYear,endYear,rank,averageRating,numVotes,directors,writers,genres
2,tt7366338,Chernobyl,2019,2019,3,9.3,970478,Johan Renck,Craig Mazin,"Drama, History, Thriller"
118,tt10048342,The Queen's Gambit,2020,2020,119,8.5,630269,Scott Frank,"Scott Frank, Allan Scott, Walter Tevis",Drama
1,tt0185906,Band of Brothers,2001,2001,2,9.4,570504,"David Frankel, Mikael Salomon, Tom Hanks, Davi...","Stephen Ambrose, Erik Bork, E. Max Frye, Tom H...","Action, Drama, History"
626,tt9140560,WandaVision,2021,2021,627,7.9,403165,Matt Shakman,"John Buscema, Peter Cameron, Mackenzie Dohr, L...","Action, Comedy, Fantasy"
0,tt0903747,Breaking Bad,2008,2013,1,9.5,2384857,"Michelle MacLaren, Adam Bernstein, Vince Gilli...","Vince Gilligan, Peter Gould, George Mastras, S...","Crime, Drama, Thriller"

### Q17. 
Find the most popular genre combination (the exact genres string, not individual genres) based on the highest average numVotes.

In [22]:
data.groupby("genres")["numVotes"].mean().nlargest(1).reset_index(name="num of votes")

                    genres  num of votes
0  Action, Comedy, Fantasy      403165.0

### Q18. 
Find the writer who has written shows across the widest range of years (i.e., max(endYear) - min(startYear) for each writer). List their name and the span of years.

In [23]:
df = data.assign(writer=data["writers"].str.split(",")).explode("writer")
df["writer"] = df["writer"].str.strip().str.lower()

df = df[df["writer"] != "-"].dropna(subset=["writer"])

(
    df.groupby("writer")
    .agg(
        start_min=("startYear", lambda x: x.dt.year.min()),
        end_max=("endYear", lambda x: x.dt.year.max()),
    )
    .assign(span=lambda x: x["end_max"] - x["start_min"])
    .nlargest(1, "span")
)

                 start_min  end_max  span
writer
arthur phillips       1951     2024    73

### Q19. 
For each genre, calculate the total number of votes (numVotes) received by all shows in that genre (counting multi-genre shows toward each of their genres). Then find the top 3 genres by total votes.

In [24]:
df = data.assign(genre=data["genres"].str.split(",")).explode("genre")
df["genre"] = df["genre"].str.strip().str.lower()

df.groupby("genre")["numVotes"].sum().nlargest(3).reset_index()

    genre  numVotes
0   drama  95580733
1  comedy  43678651
2   crime  42284322

### Q20. 
Find the director who has directed the most shows with an average rating above 9.0. Show their name and the count of such shows.

In [25]:
df = data.assign(director=data["directors"].str.split(",")).explode("director")
df["director"] = df["director"].str.strip()

df = df[df["director"] != "-"].dropna(subset=["director"])

(df[df["averageRating"]>=9.0].groupby("director")["averageRating"].size().nlargest(1).reset_index(name="no of count"))

      director  no of count
0  Emma Napper            4

### Q21. 
For each decade (e.g., 1950s, 1960s, …, 2010s), find the average rating of shows started in that decade. Then list the top 3 decades with the highest average rating.

In [26]:
data["decade"] = (data["startYear"].dt.year //10 )*10

data.groupby("decade")["averageRating"].mean().nlargest(3).reset_index()

   decade  averageRating
0    1970       8.136646
1    1980       8.109016
2    1990       8.091241

### Q22. 
Find the writer–director pair (same person being both writer and director) who has achieved the highest average rating across their shows. List their name and the average rating

In [27]:
df = (
    data.assign(
        writer=data["writers"].str.split(","),
        director=data["directors"].str.split(",")  
    )
    .explode("writer")
    .explode("director")
)

df["writer"] = df["writer"].str.strip()
df["director"] = df["director"].str.strip()

valid_data = df[
    ~df["director"].isin(["-", "", None]) & 
    ~df["writer"].isin(["-", "", None]) & 
    (df["writer"] == df["director"])
]


(valid_data.groupby(["writer", "director"])["averageRating"]
          .mean()
          .nlargest(1)
          .reset_index())

             writer          director  averageRating
0  Gunnam Gangaraju  Gunnam Gangaraju            9.6

### Q23. 
For each genre, find the show with the highest number of votes. List genre, primaryTitle, and numVotes.

In [ ]:
df = data.assign(genre=data["genres"].str.split(",")).explode("genre")
df["genre"] = df["genre"].str.strip()

df.sort_values("numVotes", ascending=False).groupby("genre")[
    ["primaryTitle", "numVotes"]
].first().reset_index()

          genre                                       primaryTitle  numVotes
0        Action                                    Game of Thrones   2472062
1     Adventure                                    Game of Thrones   2472062
2     Animation                                     Rick and Morty    665695
3     Biography                                             Narcos    508924
4        Comedy                                            Friends   1158004
5         Crime                                       Breaking Bad   2384857
6   Documentary                                       Planet Earth    229089
7         Drama                                    Game of Thrones   2472062
8        Family                                       Planet Earth    229089
9       Fantasy                                    Stranger Things   1478495
10    Game-Show                           Whose Line Is It Anyway?     48374
11      History                                          Chernobyl    970478
12       Horror                                    Stranger Things   1478495
13        Music                                            Atlanta     95602
14      Musical                            Flight of the Conchords     68696
15      Mystery                                           Sherlock   1059076
16         News                 Last Week Tonight with John Oliver    101016
17   Reality-TV                                    Clarkson's Farm     77353
18      Romance                                            Friends   1158004
19       Sci-Fi                                          Westworld    550908
20        Short  Inside Look: The People v. O.J. Simpson - Amer...     27654
21        Sport                                          Ted Lasso    413552
22    Talk-Show                 Last Week Tonight with John Oliver    101016
23     Thriller                                       Breaking Bad   2384857
24          War                                            M*A*S*H     67573
25      Western                                        Yellowstone    286365

### Q24. 
Which genre has the highest average IMDb rating?

In [43]:
df = data.assign(genre=data["genres"].str.split(",")).explode("genre")
df["genre"]=df["genre"].str.strip()
df.groupby("genre")["averageRating"].mean().nlargest(5).reset_index()

         genre  averageRating
0    Talk-Show       8.228846
1  Documentary       8.203945
2          War       8.182353
3         News       8.153846
4      Musical       8.122727